Repository: Pragament/flutter_loan_lend_EMI_manager_app
Catalog: lib/presentation/l10n/app_*.arb
Languages: te

# appTitle
source: Loan & Lending EMI Manager
te: రుణ నిర్వహణ

source: E.M.I
te: ఇ.ఎం.ఐ

source: Loan Amount
te: రుణ మొత్తం

source: Tenure
te: కాలావధి

source: months
te: నెలలు

source: Interest Rate
te: వడ్డీ రేటు

source: Interest Amount
te: వడ్డీ మొత్తం

source: Total Amount
te: మొత్తం మొత్తం

source: Complete Onboarding
te: ఆన్‌బోర్డింగ్ పూర్తి చేయండి

# caroselHeading
source: EMI Breakdown
te: ఇఎంఐ వివరాలు

source: Loan
te: రుణం

source: Lend
te: ఊరేయి

source: Share
te: వాటా

source: Title
te: శీర్షిక

source: Start Date
te: ప్రారంభ తేదీ

source: End Date
te: ముగింపు తేదీ

source: Contact Person Name
te: సంపర్క్ వ్యక్తి పేరు

source: Contact Person Phone
te: సంపర్క్ వ్యక్తి ఫోన్

source: Contact Person Email
te: సంపర్క్ వ్యక్తి ఇమెయిల్

# otherInfo
source: Other Information
te: ఇతర సమాచారం

source: Processing Fee
te: ప్రాసెసింగ్ ఫీజు

source: Other Charges
te: ఇతర ఛార్జీలు

source: Part Payment
te: భాగం చెల్లింపు

source: Advance Payment
te: ముందస్తు చెల్లింపు

source: Insurance Charges
te: ఇన్సూరెన్స్ ఛార్జీలు

source: Moratorium
te: మొరటోరియం

source: Moratorium Month
te: మొరటోరియం నెల

source: Moratorium Type
te: మొరటోరియం రకం

source: Monthly EMI
te: మాసిక ఇఎంఐ

source: Total EMI
te: మొత్తం ఇఎంఐ

source: Paid
te: చెల్లించబడింది

# enterAmount
source: Please enter the amount
te: దయచేసి మొత్తం నమోదు చేయండి

# enterInterestRate
source: Please enter the interest rate
te: దయచేసి వడ్డీ రేటు నమోదు చేయండి

# enterStartDate
source: Please enter the start date
te: దయచేసి ప్రారంభ తేదీ నమోదు చేయండి

source: Save
te: సేవ్

# legendInterestAmount
source: Interest Amount
te: వడ్డీ మొత్తం

# legendPrincipalAmount
source: Principal Amount
te: రుణ మొత్తం

source: Edit
te: సవరించు

source: Delete
te: తొలగించు

source: Confirm Delete
te: తొలగింపు ధృవీకరణ

# areYouSure
source: Are you sure you want to delete this EMI?
te: మీరు నిజంగా ఈ EMI రికార్డును తొలగించాలని అనుకుంటున్నారా?

source: Cancel
te: రద్దు

source: year
te: సంవత్సరం

source: years
te: సంవత్సరాలు

source: month
te: నెల

source: Preview
te: మునుపటి వీక్షణ

source: Switch to Months
te: నెలలకు మార్చండి

source: Switch to Years
te: సంవత్సరాలకు మార్చండి

source: Tags
te: ట్యాగ్‌లు

source: Skip
te: అనుసరించండి

source: next
te: తదుపరి

# welcome
source: Welcome to the English version of our app. Here you can manage your loans and EMIs efficiently.
te: మీరు మా యాప్ యొక్క తెలుగు సంచికలో ఉన్నారు. ఇక్కడ మీరు మీ రుణాలను మరియు ఈ.ఎమ్.ఐలను సులభంగా నిర్వహించవచ్చు.

# legendBalanceAmount
source: Balance Amount
te: మిగిలిన మొత్తం

source: No Tenure
te: కాలవ్యవధి లేదు

source: Add EMI
te: EMI జోడించండి

source: principalAmount
te: అసలు మొత్తం

source: deleteEmi
te: EMI తొలగించండి

source: emiPerMonth
te: నెలకు EMI

source: aggregate
te: మొత్తం

source: noDataAvailable
te: డేటా అందుబాటులో లేదు

source: noEmiMessage
te: EMI కనుగొనబడలేదు

# amortizationTableTitle
source: Amortization Table
te: రుణ విభజన పట్టిక

source: manageTags
te: ట్యాగ్‌లను నిర్వహించండి

source: noEmis
te: EMIలు లేవు

source: language
te: భాష

source: selectLanguage
te: భాషను ఎంచుకోండి

# eulaLoadError
source: Failed to load EULA.
te: EULA లోడ్ చేయడంలో విఫలమైంది.

# eulaRetry
source: Retry
te: మళ్లీ ప్రయత్నించండి

# eulaVersion
source: Version
te: వెర్షన్

# eulaAgree
source: I have read the entire terms and conditions
te: నేను అన్ని నిబంధనలు మరియు షరతులను చదివాను

# eulaAccept
source: Accept
te: అంగీకరించు

# eulaDecline
source: Decline
te: నిరాకరించు

# eulaTitle
source: End User License Agreement
te: ఎండ్ యూజర్ లైసెన్స్ ఒప్పందం

source: EULA Declined
te: EULA తిరస్కరించబడింది

# eulaAlertDialog
source: You must accept the EULA to use this app.
te: ఈ యాప్‌ను ఉపయోగించడానికి మీరు EULAని అంగీకరించాలి.

source: Close
te: మూసివేయి

# noDataTitle
source: No data yet. Let's get started!
te: ఇంకా డేటా లేదు. ప్రారంభిద్దాం!

# noDataDescription
source: Start by creating a Loan or Lend using the buttons below. You'll then see helpful charts and tables here to track your finances. Tap the Tour button anytime to let the app guide you through the process.
te: కింద ఉన్న బటన్‌లను ఉపయోగించి లోన్ లేదా లెండ్‌ను సృష్టించండి. మీ ఆర్థికాలను ట్రాక్ చేయడానికి మీరు ఇక్కడ సహాయక చార్ట్‌లు మరియు పట్టికలను చూడవచ్చు. యాప్ మీకు ప్రక్రియను చూపించేందుకు ఎప్పుడైనా టూర్ బటన్‌ను నొక్కండి.

# tourButtonLabel
source: Tour
te: టూర్
